the_pointer_document.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-11 Sun 17:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Pointer Document</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">The Pointer Document</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org20060cd">1. Basic Pointers</a>
<ul>
<li><a href="#orgd790791">1.1. Size in Memory</a></li>
<li><a href="#orgc264ad7">1.2. Basic Use</a></li>
<li><a href="#orga226b2c">1.3. Use: Call by Reference</a></li>
</ul>
</li>
<li><a href="#orgdcd885e">2. Function Pointers</a>
<ul>
<li><a href="#orga9f4004">2.1. Simple But Useless Example</a></li>
<li><a href="#org36cabfa">2.2. Use: Calling Different Functions</a></li>
</ul>
</li>
<li><a href="#org2b683c9">3. Pointers to Pointers</a>
<ul>
<li><a href="#org18af7e1">3.1. Use:</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org20060cd" class="outline-2">
<h2 id="org20060cd"><span class="section-number-2">1</span> Basic Pointers</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd790791" class="outline-3">
<h3 id="orgd790791"><span class="section-number-3">1.1</span> Size in Memory</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Here we'll declare pointers of different types and check their size in memory.  The results are from running on a 64 bit machine.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #d33682;">#include</span><span style="color: #2aa198;">&lt;stdio.h&gt;</span>
<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">declare variables of different types</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 1;
<span style="color: #268bd2;">char</span> <span style="color: #6c71c4;">c</span> = <span style="color: #2aa198;">"c"</span>;
<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">d</span> = 3.14;
<span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f</span> = 1.61;
<span style="color: #268bd2;">unsigned</span> <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">ui</span> = 400;
<span style="color: #268bd2;">long</span> <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">li</span> = 4000;
<span style="color: #268bd2;">unsigned</span> <span style="color: #268bd2;">char</span> <span style="color: #6c71c4;">uc</span> = <span style="color: #2aa198;">"u"</span>;

<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">create pointers to variables</span>
<span style="color: #268bd2;">int</span> *<span style="color: #6c71c4;">pi</span> = &amp;i;
<span style="color: #268bd2;">char</span> *<span style="color: #6c71c4;">pc</span> = &amp;c;
<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">can also put the * on the type</span>
<span style="color: #268bd2;">double</span>* <span style="color: #6c71c4;">pd</span> = &amp;d;
<span style="color: #268bd2;">float</span>* <span style="color: #6c71c4;">pf</span> = &amp;f;
<span style="color: #268bd2;">unsigned</span> <span style="color: #268bd2;">int</span> *<span style="color: #6c71c4;">pui</span> = &amp;ui;
<span style="color: #268bd2;">long</span> <span style="color: #268bd2;">int</span> *<span style="color: #6c71c4;">pli</span> = &amp;li;
<span style="color: #268bd2;">unsigned</span> <span style="color: #268bd2;">char</span> *<span style="color: #6c71c4;">puc</span> = &amp;uc;

printf(<span style="color: #2aa198;">"The size of an int %zu bytes, size of pointer to int %zu bytes \n"</span>, <span style="color: #859900;">sizeof</span> i, <span style="color: #859900;">sizeof</span> pi);
printf(<span style="color: #2aa198;">"The size of an char %zu bytes, size of pointer to char %zu bytes \n"</span>, <span style="color: #859900;">sizeof</span> c, <span style="color: #859900;">sizeof</span> pc);
printf(<span style="color: #2aa198;">"The size of an double %zu bytes, size of pointer to double %zu bytes \n"</span>, <span style="color: #859900;">sizeof</span> d, <span style="color: #859900;">sizeof</span> pd);

</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">The size of an int 4 bytes</td>
<td class="org-left">size of pointer to int 8 bytes</td>
</tr>

<tr>
<td class="org-left">The size of an char 1 bytes</td>
<td class="org-left">size of pointer to char 8 bytes</td>
</tr>

<tr>
<td class="org-left">The size of an double 8 bytes</td>
<td class="org-left">size of pointer to double 8 bytes</td>
</tr>
</tbody>
</table>

<p>
It looks like, while different types take up differing amount of memory, the size of all pointers are 8 bytes regardless of the type to which they point.  
</p>
</div>
</div>

<div id="outline-container-orgc264ad7" class="outline-3">
<h3 id="orgc264ad7"><span class="section-number-3">1.2</span> Basic Use</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Here we show how to use pointers.
</p>
</div>
</div>

<div id="outline-container-orga226b2c" class="outline-3">
<h3 id="orga226b2c"><span class="section-number-3">1.3</span> Use: Call by Reference</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>C</code> makes copies of variables that are used in a function.  So if our program
changes the value of a variable it is really only changing the value of the
<b><b>copy</b></b> of the variable.  If we want to actually change the value of a
variable we have to pass a pointer to the variable's address in memory.
</p>


<p>
The following program swaps the value of two variables using pointers. 
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #d33682;">#include</span><span style="color: #2aa198;">&lt;stdio.h&gt;</span>

<span style="color: #268bd2;">void</span> <span style="color: #b58900;">swap_int</span>(<span style="color: #268bd2;">int</span> *<span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">int</span> *<span style="color: #6c71c4;">b</span>){

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">tmp</span> = *a;
*a = *b;
*b = tmp;

}

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span>(){

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">x</span> = 3;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">y</span> = 7;

swap_int(&amp;x, &amp;y);
printf(<span style="color: #2aa198;">"x is %d, and y is %d\n"</span>, x, y);

}


</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">x is 7</td>
<td class="org-left">and y is 3</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgdcd885e" class="outline-2">
<h2 id="orgdcd885e"><span class="section-number-2">2</span> Function Pointers</h2>
<div class="outline-text-2" id="text-2">
<p>
A function pointer points to a point in memory which is the start of a series of instructions.  They can be used to mimic first-class functions in C.
</p>
</div>

<div id="outline-container-orga9f4004" class="outline-3">
<h3 id="orga9f4004"><span class="section-number-3">2.1</span> Simple But Useless Example</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d33682;">#include</span><span style="color: #2aa198;">&lt;stdio.h&gt;</span>

<span style="color: #268bd2;">void</span> <span style="color: #b58900;">hello_fun</span>()
{
printf(<span style="color: #2aa198;">"Hello!\n"</span>);
}

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span>()
{

<span style="color: #268bd2;">void</span> (*<span style="color: #b58900;">ptr</span>)() = &amp;hello_fun;  <span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">function pointer which points to the address in memory of hello_fun</span>
ptr(); <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">call the function pointed to</span>

}
</pre>
</div>

<pre class="example">
Hello!
</pre>
</div>
</div>

<div id="outline-container-org36cabfa" class="outline-3">
<h3 id="org36cabfa"><span class="section-number-3">2.2</span> Use: Calling Different Functions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In the example below we'll use a pointer to a function to allow the user to decide whether to apply the sum, subtract, or divide function to the supplied numbers. 
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #d33682;">#include</span><span style="color: #2aa198;">&lt;stdio.h&gt;</span>

<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">Instead of user input define global variables</span>
<span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75; font-style: italic;">#define FUN = 2</span><span style="color: #586e75; font-style: italic;"> */</span>
<span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75; font-style: italic;">#define NUM1 = 7</span><span style="color: #586e75; font-style: italic;"> */</span>
<span style="color: #586e75; font-style: italic;">/* </span><span style="color: #586e75; font-style: italic;">#define NUM2 = 4</span><span style="color: #586e75; font-style: italic;"> */</span>

<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">define different functions</span>
<span style="color: #268bd2;">double</span> <span style="color: #b58900;">sum</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">b</span>){<span style="color: #859900;">return</span> a + b;}
<span style="color: #268bd2;">double</span> <span style="color: #b58900;">subtract</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">b</span>){<span style="color: #859900;">return</span> a - b;}
<span style="color: #268bd2;">double</span> <span style="color: #b58900;">divide</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">b</span>){<span style="color: #859900;">return</span> ((<span style="color: #268bd2;">double</span>) a) / ((<span style="color: #268bd2;">double</span>) b);}
<span style="color: #268bd2;">double</span> <span style="color: #b58900;">multiply</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">b</span>){<span style="color: #859900;">return</span> ((<span style="color: #268bd2;">double</span>) a) * ((<span style="color: #268bd2;">double</span>) b);}

<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">podoubleer to function</span>
<span style="color: #586e75; font-style: italic;">//</span><span style="color: #586e75; font-style: italic;">int (funptr*)();</span>
<span style="color: #268bd2;">double</span> <span style="color: #b58900;">general_function</span>(<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">Select</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">b</span>)
{
    <span style="color: #586e75; font-style: italic;">/*  </span><span style="color: #586e75; font-style: italic;">Declare a type to point to a function with parameters (int a, int b)</span>
<span style="color: #586e75; font-style: italic;">        and returning an int.</span>
<span style="color: #586e75; font-style: italic;">    */</span>
    <span style="color: #859900;">typedef</span> <span style="color: #268bd2;">double</span> (*<span style="color: #268bd2;">fnptr</span>)(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">b</span>);

    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">Dispatch Table</span>
    <span style="color: #268bd2;">fnptr</span> <span style="color: #6c71c4;">Table</span>[] =
        {
            sum,
            subtract,
            multiply,
            divide,
        };

    <span style="color: #586e75; font-style: italic;">//  </span><span style="color: #586e75; font-style: italic;">Dispatch to the requested function.</span>
    <span style="color: #859900;">return</span> Table[Select](a, b);
};

<span style="color: #268bd2;">int</span>
<span style="color: #b58900;">main</span>(){

printf(<span style="color: #2aa198;">"9 + 3 = %f.\n"</span>, general_function(0, 9, 3));
printf(<span style="color: #2aa198;">"9 - 3 = %f.\n"</span>, general_function(1, 9, 3));
printf(<span style="color: #2aa198;">"9 * 3 = %f.\n"</span>, general_function(2, 9, 3));
printf(<span style="color: #2aa198;">"9 / 3 = %f.\n"</span>, general_function(3, 9, 3));

}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">9</td>
<td class="org-left">+</td>
<td class="org-right">3</td>
<td class="org-left">=</td>
<td class="org-right">12.000000.</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">-</td>
<td class="org-right">3</td>
<td class="org-left">=</td>
<td class="org-right">6.000000.</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">*</td>
<td class="org-right">3</td>
<td class="org-left">=</td>
<td class="org-right">27.000000.</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">/</td>
<td class="org-right">3</td>
<td class="org-left">=</td>
<td class="org-right">3.000000.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org2b683c9" class="outline-2">
<h2 id="org2b683c9"><span class="section-number-2">3</span> Pointers to Pointers</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org18af7e1" class="outline-3">
<h3 id="org18af7e1"><span class="section-number-3">3.1</span> Use:</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2021-04-11 Sun 17:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
